app/Models/UserModel.php

SELECT `u`.`name`, `u`.`id_usuario`, `u`.`email`, `u`.`password`, `p`.`permiso`
FROM `usuario` `u`
LEFT JOIN `permiso` `p` ON `u`.`id_permiso` = `p`.`id_permiso`
GROUP BY `u`.`id_usuario`
---
    public function Usuarios(){
        $query = $this->db->table('usuario u')
            ->select('u.name, u.id_usuario, u.email, u.password, p.permiso')
            ->join('permiso p', 'u.id_permiso = p.id_permiso', 'left')
            ->groupBy('u.id_usuario')
            ->get();